<?php

return [
    /*
    |--------------------------------------------------------------------------
    | Cache Headers Configuration
    |--------------------------------------------------------------------------
    |
    | このファイルでは、URL別のキャッシュヘッダー設定を管理します。
    |
    */

    /*
    |--------------------------------------------------------------------------
    | Route Cache Settings
    |--------------------------------------------------------------------------
    |
    | ルート別のキャッシュ設定
    |
    */
    'routes' => [
        'index' => [ // パラメータ無し
            'cdn_max_age' => 3600,
        ],
        'content.search' => [
            'query_params' => ['q'],
            'cdn_max_age' => 7200,
        ],
        'content.detail' => [ // パスパラメータにIDが含まれる想定
            'cdn_max_age' => 3600,
        ],
        // 他のルート設定をここに追加
    ],

    /*
    |--------------------------------------------------------------------------
    | Default Cache Settings
    |--------------------------------------------------------------------------
    |
    | デフォルトのキャッシュ設定
    |
    */
    'defaults' => [
        'browser_max_age' => 60, // ブラウザキャッシュのmax-age（秒）
        'cdn_stale_while_revalidate' => 3600, // CDNのstale-while-revalidate（秒）
    ],
]; 